CSI API ETABS v1
cPluginContract Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPluginContract
Public Interface cPluginContract
Dim instance As cPluginContract
public interface class cPluginContract
type cPluginContract =  interface end
The cPluginContract type exposes the following members.
Methods
Name | Description
Info
 Provides information about the plugin
Main
 The entry point for launching the plugin
Top
See Also
Reference
ETABSv1 Namespace